SampleMessages/Cleo/RequestAmbulanceDispatch-v2-0/2012-04-24/SouthEastHealth_RequestAmbulanceDispatch-v2-0_20120420_02_wrapped.xml.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Header>
		<Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0</Action>
	</s:Header>
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<DistributionEnvelope xmlns="urn:nhs-itk:ns:201005">
			<header trackingid="17EAB01A-D9DE-42A9-A22E-6924FFD500B2" service="RequestAmbulanceDispatch-v2-0">
				<auditIdentity>
					<id uri="urn:nhs-uk:identity:ods:SEH" />
				</auditIdentity>
				<manifest count="1">
					<manifestitem id="uuid_F5E75CD3-F4E0-40B4-B2AC-7E5D8CF969F5" mimetype="text/xml" profileid="urn:nhs-en:profile:nhs111AmbulanceRequest-v2-0" />
				</manifest>
				<senderAddress uri="urn:nhs-uk:addressing:ods:SEH" />
				<handlingSpecification>
					<spec key="urn:nhs-itk:ns:201005:interaction" value="urn:nhs-itk:interaction:primaryNHS111RequestforAmbulance-v2-0" />
				</handlingSpecification>
			</header>
			<payloads count="1">
				<payload id="uuid_F5E75CD3-F4E0-40B4-B2AC-7E5D8CF969F5">
					<AmbulanceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" moodCode="RQO" classCode="PCPR" xmlns="urn:hl7-org:v3">
						<code code="828791000000100" codeSystem="2.16.80.1.113883.2.1.3.2.4.15" />
						<effectiveTime value="20120423161941" />
						<id root="A9B80105-2895-4C52-8092-E75B5C6AE60F" />
						<author typeCode="AUT" contextControlCode="OP">
							<contentId extension="COCD_TP145203GB02#AssignedAuthor" root="2.16.840.1.113883.2.1.3.2.4.18.16" xmlns="NPFIT:HL7:Localisation" />
							<functionCode code="OA" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.178" displayName="Originating Author" />
							<time value="20120423161941" />
							<COCD_TP145200GB01.AssignedAuthor classCode="ASSIGNED">
								<addr use="WP">
									<streetAddressLine>Kingston House</streetAddressLine>
									<streetAddressLine>The Long Barrow</streetAddressLine>
									<streetAddressLine>Orbital Park</streetAddressLine>
									<streetAddressLine>Ashford</streetAddressLine>
									<streetAddressLine>Kent</streetAddressLine>
									<postalCode>TN24 0GP</postalCode>
									<id nullFlavor="NA" />
								</addr>
								<code code="NR1690" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.196" displayName="Call Operator" />
								<id extension="Matthew A Rudolph" root="2.16.840.1.113883.2.1.3.2.4.18.24" />
								<telecom value="tel:01233505450" use="EC" />
								<templateId extension="COCD_TP145200GB01#AssignedAuthor" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
								<assignedPerson determinerCode="INSTANCE" classCode="PSN">
									<name>Matthew A Rudolph</name>
									<templateId extension="COCD_TP145200GB01#assignedPerson" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
								</assignedPerson>
								<representedOrganization determinerCode="INSTANCE" classCode="ORG">
									<id extension="NVE" root="2.16.840.1.113883.2.1.3.2.4.19.1" />
									<name>Great Yarmouth and Waveney NHS 111</name>
									<templateId extension="COCD_TP145200GB01#representedOrganization" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
								</representedOrganization>
							</COCD_TP145200GB01.AssignedAuthor>
						</author>
						<informationRecipient typeCode="PRCP">
							<contentId extension="COCD_TP145203GB03#IntendedRecipient" root="2.16.840.1.113883.2.1.3.2.4.18.16" xmlns="NPFIT:HL7:Localisation" />
							<COCD_TP145203GB03.IntendedRecipient classCode="ASSIGNED">
								<templateId extension="COCD_TP145203GB03#IntendedRecipient" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
								<representedOrganization determinerCode="INSTANCE" classCode="ORG">
									<id extension="NVE" root="2.16.840.1.113883.2.1.3.2.4.19.1" />
									<name>Great Yarmouth and Waveney NHS 111</name>
									<templateId extension="COCD_TP145203GB03#representedOrganization" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
								</representedOrganization>
							</COCD_TP145203GB03.IntendedRecipient>
						</informationRecipient>
						<pertinentInformation typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentTraumaFlag classCode="OBS" moodCode="EVN">
								<code code="TM" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327" />
								<value value="true" />
							</pertinentTraumaFlag>
						</pertinentInformation>
						<pertinentInformation1 typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentFireFlag classCode="OBS" moodCode="EVN">
								<code code="FR" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327" />
								<value value="false" />
							</pertinentFireFlag>
						</pertinentInformation1>
						<pertinentInformation2 typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentSceneSafeFlag classCode="OBS" moodCode="EVN">
								<code code="SC" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327" />
								<value value="true" />
							</pertinentSceneSafeFlag>
						</pertinentInformation2>
						<pertinentInformation3 typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentPoliceFlag classCode="OBS" moodCode="EVN">
								<code code="PL" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327" />
								<value value="false" />
							</pertinentPoliceFlag>
						</pertinentInformation3>
						<pertinentInformation4 typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentTrappedFlag classCode="OBS" moodCode="EVN">
								<code code="TR" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.327" />
								<value value="true" />
							</pertinentTrappedFlag>
						</pertinentInformation4>
						<pertinentInformation5 typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentEncounterEvent classCode="ENC" moodCode="EVN">
								<effectiveTime>
									<low value="20120423170636" />
								</effectiveTime>
								<id extension="PMA1" root="2.16.840.1.113883.2.1.3.2.4.18.34" />
								<id extension="14404" root="2.16.840.1.113883.2.1.3.2.4.18.35" />
								<text>Presenting condition: yuyti  Disposition: Dispatch of other emergency services 

Pathways Assessment:

Patient:  Test TESTING, Age Gender Selected: Adult, Male
Pathway Selected: PMA1, Calling About Self
An injury or other health problem was described.
Significant blood loss was not described.
An injury or other health problem was described.
Significant blood loss was described.
Loss of more than 2 mugfuls of blood was described.
Bleeding from a wound was described.
Blood spurting or spraying from a wound was described.
Instructions given were: An ambulance is being dispatched to arrive within 8 minutes.
There is no indication the scene is unsafe.
Unless you are in immediate danger, e.g. from traffic or chemical hazards, do not move.

Impalement was described.
The disposition is: Dispatch of other emergency services
A serious non-sexual assault, a sexual assault or a suicide attempt was not described.
If you can, collect together any current medications or list of medications and any medical records and give these to the crew when they arrive.
Don't have anything to eat or drink (a sip of water is fine if medication needs to be taken).

								</text>
								<informant typeCode="INF" contextControlCode="OP">
									<contentId extension="COCD_TP145007UK03#RelatedEntity" root="2.16.840.1.113883.2.1.3.2.4.18.16" xmlns="NPFIT:HL7:Localisation" />
									<COCD_TP145007UK03.RelatedEntity classCode="PRS">
										<addr nullFlavor="UNK" />
										<code code="21" codeSystem="2.16.840.1.113883.2.1.3.2.4.18.16" />
										<telecom value="tel:01233505450" use="EC" />
										<templateId extension="COCD_TP145007UK03#RelatedEntity" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
										<relationshipHolder determinerCode="INSTANCE" classCode="PSN">
											<name>Test TESTING</name>
											<templateId extension="COCD_TP145007UK03#relationshipHolder" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
										</relationshipHolder>
									</COCD_TP145007UK03.RelatedEntity>
								</informant>
								<location typeCode="LOC">
									<contentId extension="COCD_TP145222GB02#HealthCareFacility" root="2.16.840.1.113883.2.1.3.2.4.18.16" xmlns="NPFIT:HL7:Localisation" />
									<COCD_TP145222GB02.HealthCareFacility classCode="ISDLOC">
										<id nullFlavor="NA" />
										<templateId extension="COCD_TP145222GB02#HealthCareFacility" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
										<location determinerCode="INSTANCE" classCode="PLC">
											<addr use="PHYS">
												<streetName>Albion Mill,Apartment 103,King Street</streetName>
												<postalCode>NR1 2BU</postalCode>
												<additionalLocator>X62380Y30770</additionalLocator>
											</addr>
											<name />
											<templateId extension="COCD_TP145222GB02#location" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
										</location>
									</COCD_TP145222GB02.HealthCareFacility>
								</location>
								<recordTarget typeCode="RCT" contextControlCode="OP">
									<contentId extension="COCD_TP145201GB01#PatientRole" root="2.16.840.1.113883.2.1.3.2.4.18.16" xmlns="NPFIT:HL7:Localisation" />
									<COCD_TP145201GB01.PatientRole classCode="PAT">
										<addr use="H">
											<streetName>Albion Mill,Apartment 103,King Street</streetName>
											<city>Norwich</city>
											<postalCode>NR1 2BU</postalCode>
										</addr>
										<addr use="PHYS">
											<streetName>Albion Mill,Apartment 103,King Street</streetName>
											<city>Norwich</city>
											<postalCode>NR1 2BU</postalCode>
										</addr>
										<id assigningAuthorityName="NVE:Great Yarmouth and Waveney NHS 111" extension="TESTING, Test" root="2.16.840.1.113883.2.1.3.2.4.18.24" />
										<telecom value="tel:01233505450" use="EC" />
										<telecom use="H" />
										<templateId extension="COCD_TP145201GB01#PatientRole" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
										<patientPatient classCode="PSN" determinerCode="INSTANCE">
											<administrativeGenderCode code="1" codeSystem="2.16.840.1.113883.2.1.3.2.4" displayName="Male" />
											<birthTime nullFlavor="NA" />
											<name>
												<given>Test</given>
												<family>TESTING</family>
											</name>
											<templateId extension="COCD_TP145201GB01#patientPatient" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
											<languageCommunication>
												<languageCode code="en" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.70" />
												<modeCode code="RSP" codeSystem="2.16.840.1.113883.6.60" displayName="Received Spoken" />
												<preferenceInd nullFlavor="UNK" />
												<proficiencyLevelCode code="F" codeSystem="2.16.840.1.113883.5.61" displayName="Fair" />
												<templateId extension="COCD_TP145201GB01#languageCommunication" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
											</languageCommunication>
										</patientPatient>
										<providerOrganization classCode="ORG" determinerCode="INSTANCE">
											<id extension="Z10000" root="2.16.840.1.113883.2.1.3.2.4.19.1" />
											<name>UNKNOWN</name>
											<standardIndustryClassCode code="001" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.289" displayName="GP Practice" />
											<templateId extension="COCD_TP145201GB01#providerOrganization" root="2.16.840.1.113883.2.1.3.2.4.18.2" />
										</providerOrganization>
									</COCD_TP145201GB01.PatientRole>
								</recordTarget>
							</pertinentEncounterEvent>
						</pertinentInformation5>
						<pertinentInformation6 typeCode="PERT">
							<seperatableInd value="false" />
							<pertinentTriageDisposition classCode="OBS" moodCode="EVN">
								<code code="TD" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.419" />
								<value code="Dx109" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.414" displayName="Dispatch of other emergency services" />
							</pertinentTriageDisposition>
						</pertinentInformation6>
						<reason typeCode="RSON">
							<seperatableInd value="false" />
							<justifyingTriageOutcome classCode="OBS" moodCode="EVN">
								<code code="TO" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.328" />
								<value code="R2" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.329" displayName="Red 2" />
							</justifyingTriageOutcome>
						</reason>
						<replacementOf typeCode="RPLC">
							<priorPreviousAmbulanceRequest classCode="PCPR" moodCode="RQO">
								<id root="1DCD8017-5715-4CC5-9ECF-869F3647B538" />
							</priorPreviousAmbulanceRequest>
						</replacementOf>
					</AmbulanceRequest>
				</payload>
			</payloads>
		</DistributionEnvelope>
	</s:Body>
</s:Envelope>